#+SETUPFILE: base-template.org
#+TITLE:    Estimation d'aires avec la méthode de Monte Carlo
#+SUBTITLE:     Activités #7
#+PROPERTY: header-args :results output graphics :exports none
*** Temps moyen

Dans cette section, vous allez définir un vecteur ~tE~ de taille ~p~ contenant le temps moyen mis pour obtenir de telles estimations.
Plus précisément, la j-ième coordonnée du vecteur ~tE~ (avec ~1<=j<=p~) doit contenir le temps moyen mis pour effectuer une estimation de \pi, chacune de ces estimations étant effectuée avec ~n=10**j~ points.

Indication: utiliser la primitive ~system.time~, qui renvoie le temps mis pour évaluer un expression donnée et la primitive ~replicate~ qui répète l'évaluation d'une expression.
#+BEGIN_SRC R :exports both :results output
  system.time(replicate(100, sum(1:1000)))

  vec <- matrix(0, 2,5)
  system.time(vec[1,] <- runif(5))
  system.time(vec[2,] <- runif(5))
  print(vec)
#+END_SRC

#+RESULTS:
: utilisateur     système      écoulé
:       0.001       0.000       0.001
: utilisateur     système      écoulé
:           0           0           0
: utilisateur     système      écoulé
:           0           0           0
:           [,1]        [,2]      [,3]      [,4]      [,5]
: [1,] 0.6916834 0.001697275 0.9038988 0.6834348 0.9710516
: [2,] 0.4069787 0.408694030 0.2347155 0.2954508 0.6385711

#+RESULTS:

#+BEGIN_SRC R :session pi
   ## Number of simulations
   t <- 50
   ## Numbers of points are 10**1, 10**2, ..., 10**p
   p=7
   PIE=matrix(0,t,p)
   colnames(PIE) <- 10 ** (1:p)
   tE = numeric(p)
   for( i in 1:p) {
     tE[i] <- system.time( PIE[,i] <- replicate(t,mc.pi(10**i)))['elapsed']
   }
   tE <- tE/t

#+END_SRC

#+RESULTS:

** Représentation d'un polygone sous forme de matrice

Dans la suite, on décrira un polygone à n côtés à l'aide d'une matrice de taille (n+1)*2. Plus pécisément, le polygone constitué des segments [(x_1,y_1);(x_2,y_2)], [(x_2,y_2);(x_3,y_3)], \dots, [(x_n,y_n);(x_1,y_1)] sera représenté par une matrice ~M~ telle que:
 - M[i,1] = x_i et M[i,2] = y_i pour tout i compris entre 1 et n,
 - M[n+1,1] = M[1,1] = x_1 et M[n+1,2] = M[1,2] = y_1.

On notera que:
 - chaque ligne de la matrice ~M~ représente un sommet du polygone;
 - l'ordre dans lequel sont données les lignes est important, car un segment du polygone correspond à deux points consécutifs (autrement dit deux lignes consécutives);
 - la dernière ligne de la matrice est toujours identique à la première ligne: cette redondance d'information va permettre d'alléger le code par la suite.

Par exemple, on pourra utiliser le code suivant pour définir des polygones.
#+BEGIN_SRC R :exports both :results output :session poly
  ## Definition d'une fonction très utile
  creer_polygone <- function (x,y) {
    matrix(c(x, x[1], y, y[1]), ncol=2,dimnames=list(c(), c("x","y")))
  }

  carre <- creer_polygone(c(10,10,90,90), c(30, 70, 70, 30))
  ## Une permutation cyclique des points donne le même polygone
  carre <- creer_polygone(c(10,90,90,10), c(70, 70, 30, 30))
  ## En revanche, le code suivant ne définit pas un rectangle,
  ## mais un polygone dont les arêtes se croisent.
  papillon <- creer_polygone(c(10,90,10,90), c(30,70,70,30))
  ## pour finir, voici un losange.
  losange <- creer_polygone(c(50,10,50,90),c(30,50,70,50))

  print(carre)
#+END_SRC

#+RESULTS:
:       x  y
: [1,] 10 70
: [2,] 90 70
: [3,] 90 30
: [4,] 10 30
: [5,] 10 70


*** Dimensions d'un rectangle



Définir une fonction ~boite~ qui prend en argument un polygone donné sous la forme d'une matrice (comme précédemment) et renvoie une matrice contenant l'abscisse minimale du plus petit rectangle contenant ce polygone, son abscisse maximale, son ordonnée minimale et son ordonnée maximale. Par exemple:

#+BEGIN_SRC R :exports none :session poly
  boite <- function(p) {
    dimR <- matrix(c ( min(p[,1]), max(p[,1]), min(p[,2]), max(p[,2])), ncol=2, dimnames=list(c("min","max"), c("x","y")))
    return(dimR)
  }
#+END_SRC

#+BEGIN_SRC R :exports both :results output :session poly
  print(losange)
  bo <- boite(losange)
  print(bo)
#+END_SRC

#+RESULTS:
:       x  y
: [1,] 50 30
: [2,] 10 50
: [3,] 50 70
: [4,] 90 50
: [5,] 50 30
:      x  y
: min 10 30
: max 90 70

*** Tirage de points uniformément aléatoirement dans un rectangle

Définir une fonction ~points_aleatoires~ qui prend en argument un couple ~(n, bo)~, où ~n~ est un entier et ~bo~ une boîte rectangulaire, et renvoie une matrice ~M~ contenant ~n~ points tirés uniformément au hasard dans le rectangle ~r=[xmin;xmax]*[ymin;ymax]~. Plus précisément, la matrice ~M~ est de taille ~n*2~ et chaque colonne contient un point tiré uniformément au hasard dans le rectangle ~r~. Par exemple:

#+BEGIN_SRC R :results none :session poly
  points_aleatoires <- function(n, bo) {
    x <- runif(n,min=bo['min','x'],max=bo['max','x'])
    y <- runif(n,min=bo['min','y'],max=bo['max','y'])
    return(matrix(c(x, y), ncol=2,dimnames=list(c(), c("x","y"))))
  }
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session poly
bo <- matrix(c(3, 5, 6, 8),nrow=2, dimnames=list(c("min","max"), c("x","y")))
pts <- points_aleatoires(5, bo)
print(pts)
#+END_SRC

#+RESULTS:
:             x        y
: [1,] 3.258553 7.597769
: [2,] 4.720517 7.375495
: [3,] 4.828405 7.450762
: [4,] 3.775091 7.941043
: [5,] 3.278946 7.821924

*** Mise en oeuvre

Définir une fonction ~mc.poly~ qui prend en argument un entier ~n~ correspondant au nombre de points à tirer au hasard et un ~polygone, et qui renvoie une valeur approchée de l'aire du ~polygone~ par la méthode de Monte Carlo.

#+BEGIN_SRC R :session poly
  mc.poly <- function(n, polygone, DRAW=FALSE) {
    ## la forme géométrique est la boite r de la section précédente
    bo <- boite(polygone)
    aire_bo <- (bo['max','x']-bo['min','x'])*(bo['max','y']-bo['min','y'])
    ## l'entier cpt va compter le nombre de points aléatoires qui tombent à l'intérieur du polygone
    points <- points_aleatoires(n, bo);
    pin <- appartient(points, polygone)
    if(DRAW) {
      par(mar=c(2,2,2,2)+0.1)
      plot(polygone, type='l', main="Aire d'un polygone par Monte Carlo", xlim=bo[,'x'], ylim=bo[,'y'])
      points(points[pin,1], points[pin,2], col='firebrick', pch=20)
      points(points[!pin,1], points[!pin,2], col='darkblue', pch=20)
   }
    return((sum(pin)/n) * aire_bo)
  }
#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :exports both :results output :session poly
print(mc.poly(10, losange))
print(mc.poly(1000, losange))
print(mc.poly(10000, losange))
#+END_SRC


#+RESULTS:
: [1] 1280
: [1] 1606.4
: [1] 1622.4


*** Programmation

    Définir une fonction ~aire.poly~ qui prend en argument un polygone et calcule son aire exacte.

#+BEGIN_SRC R :exports none :results none :session poly
  aire.poly <- function(polygone) {
    aire <- function(i) polygone[i-1,1]*polygone[i,2] - polygone[i,1]*polygone[i-1,2]
    sum(sapply(2:nrow(polygone), aire))/2
  }
#+END_SRC

#+RESULTS:

Par exemple:

#+BEGIN_SRC R :exports both :results output :session poly
print(aire.poly(surprise))
print(mc.poly(5000,surprise))
#+END_SRC

#+RESULTS:
: [1] -71
: [1] 69.1944

L'aire du polygone est négative, car les sommets sont donnés dans le sens anti-trigonométrique (celui des aiguilles d'une montre).

